module.exports = name => `// =============================================================================
// ${name}のページを表します。
// =============================================================================

.d-${name} {
  // Abstractions
  // ===========================================================================

  $_: &;
  $_elementName-fontSize: 16px;
  content: "ここはこのファイル内のみで使用する変数・関数・ミックスインを定義します。プレフィックスとしてアンダースコアを付与してください。";

  // Block
  // ===========================================================================

  content: "ここはBEMのBlockに相当するスタイルを定義します。";

  // Elements
  // ===========================================================================

  &-elementName {
    content: "ここはBEMのElementに相当するスタイルを定義します。";

    &--elementModifierName {
      content: "ここはBEMのElementのModifierに相当するスタイルを定義します。";
    }
  }

  // Modifiers
  // ===========================================================================

  &--blockModifierName {
    content: "ここはBEMのBlockのModifierに相当するスタイルを定義します。";

    #{$_} {
      &-elementName {
        content: "ここはBEMのBlockのModifierのElementに相当するスタイルを定義します。";
      }
    }
  }
}
`;
